from telegram import ReplyKeyboardMarkup

MAIN_MENU_BUTTONS = [
    ["🆘 Попросить о помощи"],
    ["➕ Предложить ресурс"],
    ["🤝 Стать волонтером"],
    ["💸 Поддержать проект"],
    ["✉️ Анонимное сообщение"],
]

HELP_MENU_BUTTONS = [
    ["🚨 Срочная помощь"],
    ["🏠 Жилье/финансы"],
    ["🧠 Психологическая помощь"],
    ["🩺 Медицинская помощь"],
    ["⚖️ Юридическая помощь"],
]

LEGAL_MENU_BUTTONS = [
    ["🏳️‍🌈 ЛГБТ+ семьи"],
    ["📝 Как сменить документы"],
    ["📢 Что такое пропаганда ЛГБТ?"],
    ["🗣️ Юридическая консультация"],
    ["🚨 Сообщить о нарушении"],
]

MEDICAL_MENU_BUTTONS = [
    ["🗣️ Медицинская консультация"],
    ["💉HRT"],
    ["❓ F64"],
    ["⚕️ Операции"],
]

GENDER_THERAPY_CHOICE_BUTTONS = [
    ["T"],
    ["E"],
]

SURGERY_INFO_KEYBOARD = [
    ["ФТМ Операции"],
    ["МТФ Операции"],
    ["Запланировать операцию"], # Кнопка для запуска callback query
]

VOLUNTEER_HELP_TYPE_KEYBOARD = [
    ["Юридическая помощь", "Психологическая помощь"],
    ["Медицинская помощь", "Финансовая помощь"],
    ["Информационная поддержка", "Техническая помощь"],
    ["Модерация", "Другая помощь"],
    ["Отмена"],
]

BACK_BUTTON = "⬅️ Назад"
DONE_BUTTON = "✅ Готово"
FINISH_MENU_KEYBOARD = [["В главное меню"]]
YES_NO_BUTTONS = [["Да", "Нет", BACK_BUTTON]]
YES_NO_MAYBE_BUTTONS = [["Да", "Нет", "Не знаю", BACK_BUTTON]]

# --- Новые кнопки для консультаций ---
PSYCH_CONSULTATION_CHOICE_BUTTONS = [
    ["Консультация"],
    ["Анонимный запрос"],
    [BACK_BUTTON],
]
