from telegram import ReplyKeyboardMarkup

BACK_BUTTON = "🔙 Назад"
MAIN_MENU_BUTTONS = [
    ["Попросить о помощи"],
    ["Предложить ресурс", "Стать волонтером"],
    ["Поддержать проект", "Анонимное сообщение"],
]
HELP_MENU_BUTTONS = [
    ["🆘 Срочная помощь"],
    ["💼 Юридическая помощь", "🏥 Медицинская помощь"],
    ["🏠 Жилье/финансы", "🧠 Психологическая помощь"],
    [BACK_BUTTON],
]
LEGAL_MENU_BUTTONS = [
    ["ЛГБТ+ семьи"],
    ["Как сменить документы"],
    ["Что такое пропаганда ЛГБТ?"],
    ["Консультация"],
    ["Сообщить о нарушении"],
    [BACK_BUTTON],
]
LEGAL_FAMILIES_BUTTONS = [
    ["ЛГБТ семьи", "Запросить консультацию по партнерским соглашениям"],
    [BACK_BUTTON],
]
GENDER_THERAPY_CHOICE_BUTTONS = [
    ["Мужская ГТ"],
    ["Женская ГТ"],
    [BACK_BUTTON],
]
MASCULINIZING_HRT_BUTTONS = [
    ["DIY", "Запросить консультацию по мужской ГТ"],
    ["Консультация"],
    [BACK_BUTTON],
]
FEMINIZING_HRT_BUTTONS = [
    ["DIY", "Запросить консультацию по женской ГТ"],
    ["Консультация"],
    [BACK_BUTTON],
]
SURGERY_CHOICE_BUTTONS = [
    ["ФТМ Операции"],
    ["МТФ Операции"],
    ["Консультация хирурга"],
    [BACK_BUTTON],
]
